const introduction = `

<p><strong>Учебное пособие «Русская литература для колледжей»</strong> разработано в соответствии с государственными общеобязательными стандартами образования Республики Казахстан и типовой учебной программой по дисциплине «Русская литература» для организаций технического и профессионального, послесреднего образования. Данное пособие создано с целью восполнить существующий пробел в учебной литературе для студентов колледжей, обучающихся по технико-технологическим направлениям.</p>

<p>В современном мире успех специалиста зависит не только от его профессиональных компетенций, но и от развитых мягких навыков (soft skills): критического мышления, коммуникабельности и креативности. Изучение русской литературы — это уникальный инструмент для развития этих качеств. Литература — это не оторванная от жизни теория, а практический инструмент для личностного роста.</p>

<p><strong>Цель пособия</strong> — помочь студентам не просто освоить курс русской литературы, но и научиться анализировать художественные тексты, критически мыслить и формировать свою гражданскую позицию. В результате вы научитесь:</p>

<ul>
  <li>Работать с информацией: понимать и анализировать сложные идеи.</li>
  <li>Чётко выражать свои мысли: вести продуктивный диалог и аргументировать свою точку зрения.</li>
  <li>Развивать творческие способности: находить нестандартные решения и подходить к задачам креативно.</li>
</ul>

<p><strong>Интеграция с ценностями «Адал азамат».</strong> Учебный материал полностью интегрирован с ценностями программы воспитания «Адал азамат», чтобы изучение литературы способствовало формированию гармоничной личности и настоящего гражданина своей страны.</p>

<ul>
  <li><strong>Ценность трудолюбие и профессионализм:</strong> через анализ произведений о сильных личностях и их жизненном пути студенты поймут, как целеустремлённость, трудолюбие и честность ведут к успеху.</li>
  <li><strong>Национальные ценности и патриотизм:</strong> включены задания, которые раскрывают взаимосвязи русской и казахской культур. Это воспитывает уважение к наследию и формирует чувство патриотизма.</li>
  <li><strong>Семья и её ценности:</strong> произведения о семейных отношениях помогают осознать важность взаимопонимания, ответственности и поддержки.</li>
  <li><strong>Образование, наука и творчество:</strong> пособие побуждает к самостоятельному поиску знаний и творческому подходу, развивая любознательность и стремление к новому.</li>
</ul>

<h3>Структура и методический подход</h3>

<ul>
  <li><strong>Теоретический материал:</strong> доступное изложение ключевых понятий, исторического контекста и литературных направлений.</li>
  <li><strong>Практические задания:</strong> деятельностный подход. Студенты не просто читают, а активно участвуют в процессе обучения.</li>
  <li><strong>Инновационные технологии:</strong> цифровые квесты и QR-коды с интерактивными заданиями (LearningApps.org).</li>
</ul>

<p><strong>Результат освоения пособия</strong> — это не только знания, но и сформированные навыки и ценности, которые станут основой для успешной карьеры и активной гражданской позиции. Пособие поможет студентам стать не только профессионалами своего дела, но и <em>Адал азамат</em> — честными, ответственными и достойными гражданами своей страны.</p>
`;

// --- Содержание ---
const contents = `
<div class='contents'>
<h3>Раздел 1.  Лишние люди</h3>
<ul>
  <li>Тема 1.1.  Образы «лишних людей» в русской литературе</li>
  <li>Тема 1.2. Образы «лишних людей» в русской литературе. А. С. Пушкин. «Евгений Онегин»</li>
  <li>Тема 1.3.  Пушкин «Евгений Онегин» . Жанр и композиция романа</li>
  <li>Тема 1.4. Татьяна – любимая героиня Пушкина</li>
  <li>Тема 1.5.  И. А. Гончаров «Обломов». История создания и особенности композиции романа. Социальная и нравственная проблематика романа</li>
  <li>Тема 1.6. И. А. Гончаров «Обломов». Образы героев романа</li>
  <li>Квест по разделу «Лишние люди»</li>
</ul>
<h3>Раздел  2:  Герой нашего времени</h3>
<ul>
  <li>Тема  2.7.М. Ю. Лермонтов  «Герой нашего времени». История создания, жанр и композиция</li>
  <li>Тема  2.8. М. Ю. Лермонтов «Герой нашего времени». Женские образы в романе</li>
  <li>Тема  2.9. Человек трагической судьбы</li>
  <li>Квест по разделу «Герой нашего времени»</li>
</ul>
<h3>Раздел  3. Человек и право</h3>
<ul>
  <li>Тема 3.10. Ф. М. Достоевский. «Преступление и наказание»</li>
  <li>Тема 3.11. Ф. М. Достоевский «Преступление и наказание»: история создания, жанр, особенности композиции</li>
  <li>Тема  3.12. Теория Раскольникова</li>
  <li>Тема  3.13. Н. А. Островский. «Бесприданница». Образ Ларисы Огудаловой</li>
  <li>Тема 3.14. Н. А. Островский. «Бесприданница». Образ Ларисы Огудаловой</li>
  <li>Тема 3.15.  Тема торга и власти денег в произведении Н.А. Островского «Бесприданница»</li>
  <li>Квест по разделу «Человек и право»</li>
</ul>
<h3>Раздел  4.  Семейные ценности</h3>
<ul>
  <li>Тема  4.16  Л. Н. Толстой. Роман-эпопея «Война и мир»</li>
  <li>Тема  4.17.  Система образов в романе «Война и мир»</li>
  <li>Тема  4.18.  А. В. Вампилов. «Старший сын»</li>
  <li>Квест по разделу «Семейные ценности»</li>
</ul>
<h3>Раздел  5: Человек в эпоху перемен</h3>
<ul>
  <li>Тема  5.19. М.А. Шолохов «Донские рассказы»</li>
  <li>Тема 5.20.   М.А. Шолохов «Донские рассказы»</li>
  <li>Тема 5.21.  Роман «Тихий Дон» (обзор)</li>
  <li>Тема 5.22. «Серебряный век» русской литературы</li>
  <li>Тема 5.23. С.А. Есенин. Лирика</li>
  <li>Тема 5.24.С.А. Есенин. Лирика. «Шаганэ ты моя, Шаганэ»</li>
  <li>Тема 5.25.  С.А. Есенин. Поэма «Анна Снегина»</li>
  <li>Тема 5.26. А. Блок Поэмы. Цикл «Стихи о Прекрасной Даме»</li>
  <li>Тема 5.27. А. Блок. Лирика. Стихи из сборника «Страшный мир»</li>
  <li>Квест по разделу «Человек в эпоху перемен »</li>
</ul>
<h3>Раздел  6. Человек в эпоху тоталитарного режима</h3>
<ul>
  <li>Тема 6.28 А. Ахматова. Лирика</li>
  <li>Тема  6.29. А. Ахматова. Поэма «Реквием»</li>
  <li>Тема  6.30.  А. Рыбаков «Дети Арбата». Сюжет и система образов романа</li>
  <li>Тема 6.31. А. Рыбаков «Дети Арбата». Судьбы героев  романа</li>
  <li>Тема 6.32. Проблема нравственного выбора</li>
  <li>Тема 6.33. М. Цветаева. Лирика</li>
  <li>Квест по разделу «Человек в эпоху тоталитарного режима »</li>
</ul>
<h3>Раздел 7.  Война в судьбах людей.</h3>
<ul>
  <li>Тема 7.34.  В. Быков «Сотников»</li>
  <li>Тема  7.35. Быков «Сотников». Образы Сотникова и Рыбака</li>
  <li>Тема  7.36.  Б.Л. Васильев «А зори здесь тихие». «У войны не женское лицо»</li>
  <li>Тема  7.37. Жизненная судьба писателя- фронтовика В.Л. Кондратьев. В.Л. Кондратьев повесть «Сашка»</li>
  <li>Тема  7.38.Твардовский. Военная лирика. А.Т. Твардовский «Василий Теркин»</li>
  <li>Тема  7.39.  Н.А. Заболоцкий. «В этой роще березовой»</li>
  <li>Тема   7.40. Б. Окуджава Лирическая поэзия. Б. Окуджава «До свидания, мальчики»</li>
  <li>Тема  7.41.  В.С. Высоцкий «Он не вернулся из боя»</li>
  <li>Тема  7.42. Е. Евтушенко «Хотят ли русские войны»</li>
  <li>Квест по разделу «Война в судьбах людей»</li>
</ul>
<h3>Раздел  8.  Тема нравственного выбора</h3>
<ul>
  <li>Тема  8.43 А.В. Вампилов «Утиная охота»</li>
  <li>Тема 8.44. Поэты-шестидесятники. Феномен «громкой» поэзии. Поэты-шестидесятники. А.А. Вознесенский</li>
  <li>Тема  8.45.  Лирика Р.И. Рождественского</li>
  <li>Тема  8.46.  Лирика Л.И. Мартынова</li>
  <li>Тема 8.47. О. Сулейменов. Лирика. «Маме». О. Сулейменов. Лирика. Поэмы</li>
  <li>Тема  8.48  Вечность и современность в поэзии Б.М. Канапьянова. Б.М. Канапьянов «Нить памяти»</li>
  <li>Квест по разделу «Тема нравственного выбора»</li>
</ul>
</div>
`;

// --- Литература ---
const literature = `
<h3>Список литературы</h3>
<ol>
  <li>Государственный общеобязательный стандарт технического и профессионального образования (Приказ Министра просвещения Республики Казахстан № 348 от 3 августа 2022 года).</li>
  <li>Типовая программа по дисциплине «Русская литература», протокол № 1 УМС технического и профессионального, послесреднего образования Министерства образования и науки Республики Казахстан от 15.07.2020 г.</li>
  <li>Агеносов В.В. Литература (русская литература XX века). 11 класс. В 2-х частях. М.: Дрофа, 2019.</li>
  <li>Аракчеева Е.В. Русская литература XII-XX века. Пособие для школьников старших классов, абитуриентов, студентов. – М: ЭКСМО, 2008.</li>
  <li>Абишева С.Д., Асылбекова М.С., З.Н. Поляк, Д.А. Сабирова. Русская литература: Методическое руководство для 11 кл. естественно-математического направления общеобразовательной школы. – Алматы, 2020.</li>
  <li>Бадиков В., Сафронова Л., Имангожина О., Айманова И., Ломова Е. Русская литература: Методическое пособие. А.: Жазушы, 2015.</li>
  <li>Емельянова О., Савельева В., Лукпанова Г. Русская литература: Методическое пособие. – А.: Жазушы, 2019.</li>
  <li>Кобец Н.Н. Рабочая тетрадь по русской литературе для 10 класса, 2022.</li>
  <li>Кобец Н.Н. Рабочая тетрадь по русской литературе для 11 класса, 2022.</li>
  <li>Крутецкая В.А. Русская литература в таблицах и схемах. 9-11 классы. – СПб.: Литера, 2013.</li>
  <li>Лактионова Н., Забинякова Г. Русская литература: Методическое руководство. 11 класс, часть 1, общественно-гуманитарное направление, 2020.</li>
  <li>Локтионова Н.П., Забинякова Г.В. Русская литература. Учебник для 11 кл. ЕМН, часть 1. – Алматы: Мектеп, 2019.</li>
  <li>Локтионова Н.П., Забинякова Г.В. Русская литература. Учебник для 11 кл. ЕМН, часть 2. – Алматы: Мектеп, 2019.</li>
  <li>Лактионова Н., Забинякова Г. Русская литература: Методическое руководство. 11 класс, часть 2, общественно-гуманитарное направление, 2020.</li>
  <li>Салханова Ж.Х. Русская литература. Учебник для 10 кл. ЕМН. – Алматы: Мектеп, 2019.</li>
  <li>Савельева В., Лукпанова Г., Емельянова О. Русская литература: Хрестоматия. – А.: Жазушы, 2019.</li>
  <li>Сборник заданий формативного оценивания по предмету «Русская литература» для 10 кл. – Нур-Султан, 2019.</li>
  <li>Сборник заданий формативного оценивания по предмету «Русская литература» для 11 кл. – Нур-Султан, 2019.</li>
  <li>Титаренко Е.А., Хадыко Е.В. Литература в схемах и таблицах. – М., 2018.</li>
  <li>Золотарева И.В., Михайлова Т.И. Поурочные разработки по литературе XIX в. – М.: ВАКО, 2004.</li>
</ol>
`;
// --- Отрисовка карточек с ценностями и уроками ---
async function renderValues() {
  try {
    const response = await fetch("lessons/manifest.json");
    if (!response.ok) throw new Error("Не найден manifest.json");
    const manifest = await response.json();

    const valuesDiv = document.querySelector(".values");
    valuesDiv.innerHTML = "";

    const valueTitles = {
      1: "Трудолюбие и профессионализм",
      2: "Независимость и патриотизм",
      3: "Справедливость и ответственность",
      4: "Единство и солидарность",
      5: "Закон и порядок",
      6: "Созидание и новаторство"
    };

    const valueImgs = {
      1: "imgs/1цен.png",
      2: "imgs/2цен.png",
      3: "imgs/3цен.png",
      4: "imgs/4цен.png",
      5: "imgs/5цен.png",
      6: "imgs/6цен.png"
    };

    let groups = {};
    manifest.forEach(item => {
      const match = item.file.match(/lesson-(\d+)-(\d+)\.html/);
      if (match) {
        const value = match[1];
        const num = parseInt(match[2]);
        if (!groups[value]) groups[value] = [];
        groups[value].push({ num, heading: item.heading });
      }
    });

    Object.entries(groups).forEach(([value, lessons]) => {
      lessons.sort((a, b) => a.num - b.num);

      let html = `
        <div class="value-card">
          <img src="${valueImgs[value]}" alt="Ценность ${value}">
          <h3>${valueTitles[value]}</h3>
          <div class="lessons-list">
      `;
      lessons.forEach((l, i) => {
        html += `<a href="#" onclick="openLesson(${value},${l.num})">Урок ${i+1}</a>`;
      });
      html += "</div></div>";
      valuesDiv.innerHTML += html;
    });
  } catch (e) {
    console.error("Ошибка генерации карточек:", e);
  }
}

// --- Открытие урока ---
async function openLesson(value, num) {
  try {
    // грузим HTML урока
    const response = await fetch(`lessons/lesson-${value}-${num}.html`);
    if (!response.ok) throw new Error("Урок не найден");
    const content = await response.text();

    // подтягиваем название из manifest.json
    const manifestResponse = await fetch("lessons/manifest.json");
    const manifest = await manifestResponse.json();
    const lessonItem = manifest.find(
      item => item.file === `lesson-${value}-${num}.html`
    );

    // переключение экранов
    document.getElementById("values-page").style.display = "none";
    document.getElementById("literature-content").style.display = "none";
    document.getElementById("lesson-content").style.display = "block";

    // ставим заголовок
    if (lessonItem) {
      document.getElementById("lesson-title").innerText = `Ценность ${value} Урок ${num}`;
    } else {
      document.getElementById("lesson-title").innerText = `Ценность ${value} Урок ${num}`;
    }

    // вставляем сам контент
    document.getElementById("lesson-text").innerHTML = content;
  } catch (error) {
    console.error(error);
    document.getElementById("lesson-text").innerHTML = "<p>Контент урока не найден.</p>";
  }
}

// --- Литература ---
function openLiterature() {
  document.getElementById("values-page").style.display = "none";
  document.getElementById("lesson-content").style.display = "none";
  document.getElementById("literature-content").style.display = "block";

  const list = literature.map((item, i) => `<p>${i+1}. ${item}</p>`).join("");
  document.getElementById("literature-text").innerHTML = list;
}

// --- Введение ---
function openIntroduction() {
  document.getElementById("values-page").style.display = "none";
  document.getElementById("lesson-content").style.display = "block";
  document.getElementById("literature-content").style.display = "none";

  document.getElementById("lesson-title").innerText = "Введение";
  document.getElementById("lesson-text").innerHTML = introduction;
}


// --- Назад ---
function goBack() {
  document.getElementById("lesson-content").style.display = "none";
  document.getElementById("literature-content").style.display = "none";
  document.getElementById("values-page").style.display = "block";
}
function openContents() {
  document.getElementById("values-page").style.display = "none";
  document.getElementById("lesson-content").style.display = "block";
  document.getElementById("literature-content").style.display = "none";

  document.getElementById("lesson-title").innerText = "Содержание";
  document.getElementById("lesson-text").innerHTML = contents;
}

function openLiterature() {
  document.getElementById("values-page").style.display = "none";
  document.getElementById("lesson-content").style.display = "block";
  document.getElementById("literature-content").style.display = "none";

  document.getElementById("lesson-title").innerText = "Литература";
  document.getElementById("lesson-text").innerHTML = literature;
}
function openQuests() {
  document.getElementById("values-page").style.display = "none";
  document.getElementById("lesson-content").style.display = "block";
  document.getElementById("literature-content").style.display = "none";

  document.getElementById("lesson-title").innerText = "Квесты";
  document.getElementById("lesson-text").innerHTML = `
    <h3>Квесты</h3>
    <p>Раздел в разработке. Здесь будут интерактивные задания и игры по литературе.</p>
  `;
}

// запускаем генерацию карточек при старте
renderValues();
